package lessons.lesson12.homework

fun main() {

//-------------------------------------------
// Задачи на приведение коллекции к значению
//-------------------------------------------
    val numbers = mutableListOf(-1, 2, 0, -5, 4, -5, 8, 300, 10, 53, 67, 873, -45, -4, 768, 594)
    val strings = mutableListOf("Kotlin", null, "Java", "Python", "Typescript" )

//1.Проверить, что размер коллекции больше 5 элементов.
    println(numbers.size > 5)

//2.Проверить, что коллекция пустая
    println(numbers.isEmpty())

//3.Проверить, что коллекция не пустая
    println(numbers.isNotEmpty())

//4.Взять элемент по индексу или создать значение если индекса не существует
    println(numbers.getOrElse(9) { 100 })

//5.Собрать коллекцию в строку
    println(numbers.joinToString())

//6.Посчитать сумму всех значений
    println(numbers.sum())

//7.Посчитать среднее
    println(numbers.average())

//8.Взять максимальное число
    println(numbers.maxOrNull())

//9.Взять минимальное число
    println(numbers.minOrNull())

//10.Взять первое число или null
    println(numbers.firstOrNull())

//11.Проверить что коллекция содержит элемент
    println(numbers.contains(100))

//-------------------------------
// Задачи на обработку коллекций
//-------------------------------

//12.Отфильтровать коллекцию по диапазону 18-30
    println(numbers.filter{it in 18..30})

//13.Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(numbers.filterNot{it % 6 == 0})

//14.Очистить текстовую коллекцию от null элементов
    println(strings.filterNotNull())

//15.Преобразовать текстовую коллекцию в коллекцию длин слов
    println(strings
        .filterNotNull()
        .map{it.length})

//16.Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    println(strings.associate {it?.reversed() to it?.length})

//17.Отсортировать список в алфавитном порядке
    val sortedStrings = strings.filterNotNull().sorted()
    println(sortedStrings)

//18.Взять первые 3 элемента списка
    println(strings.take(3))

//19.Распечатать квадраты элементов списка
    println(numbers.forEach { it * it })

//20.Группировать список по первой букве слов
    println(strings.filterNotNull().groupBy{ it[0] })

//21.Очистить список от дублей
    println(numbers.distinct())

//22.Отсортировать список по убыванию
    println(numbers.sortDescending())

//23.Взять последние 3 элемента списка
    println(strings.takeLast(3))

    println(numberListProcessing(emptyList()))
    println(numberListProcessing(listOf(1, 2, 3)))
    println(numberListProcessing(listOf(0, 20, 30, 40, 50)))
    println(numberListProcessing(listOf(3000, 3000, 3000, 3000)))
    println(numberListProcessing(listOf(10, 10, 10, 10, 10)))
    println(numberListProcessing(listOf(12345, 67890, 12345, 67890)))
    println(numberListProcessing(listOf(-20, -15, -12, -11, -13)))
    println(numberListProcessing(listOf(1001, 1002, 1003, 1004, 1005)))
    println(numberListProcessing(listOf(3, 14, 20, 30, 40)))
    println(numberListProcessing(listOf(1, 2, 20, 30, 40)))
    analyseGrades(listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12))

    val list = listOf(
        "Стол",
        "табурет",
        "ваза",
        "Кружка",
        "Зеркало",
        "ковер",
        "Шкаф",
        "часы",
        "Люстра",
        "подушка",
        "Картина",
        "столик",
        "Вазон",
        "шторы",
        "Пуф",
        "книга",
        "Фоторамка",
        "светильник",
        "Коврик",
        "вешалка",
        "Подставка",
        "телевизор",
        "Комод",
        "полка",
        "Абажур",
        "диван",
        "Кресло",
        "занавеска",
        "Бра",
        "пепельница",
        "Глобус",
        "статуэтка",
        "Поднос",
        "фигурка",
        "Ключница",
        "плед",
        "Тумба",
        "игрушка",
        "Настенные часы",
        "подсвечник",
        "Журнальный столик",
        "сувенир",
        "Корзина для белья",
        "посуда",
        "Настольная лампа",
        "торшер",
        "Этажерка"
    )
    println(transformToCatalog(list))
    println(countAverageWordLength(list))

    println(categorizeNumbers(listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)))

    val ages = listOf(22, 18, 30, 45, 17, null, 60)
    println(findFirstAge(ages, 18))
    println(findFirstAge(ages, 50))
}

//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции
// используя конструкцию when
//
//Если коллекция пустая - “Пусто”
//Если количество элементов меньше пяти - “Короткая”
//Если коллекция начинается с 0 - “Стартовая”
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток

fun numberListProcessing(numberList: List<Int>): String {
    return when {
        numberList.isEmpty() -> "Пусто"
        numberList.size < 5 -> "Короткая"
        numberList[0] == 0 -> "Стартовая"
        numberList.sum() > 10000 -> "Массивная"
        numberList.average() == 10.0 -> "Сбалансированная"
        numberList.joinToString("").length == 20 -> "Клейкая"
        numberList.max() < -10 -> "Отрицательная"
        numberList.min() > 1000 -> "Положительная"
        numberList.containsAll(listOf(3, 14)) -> "Пи***тая"
        else -> "Уникальная"
    }
}

//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
// Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода
// являлся основой для следующего.

fun analyseGrades(grades: List<Int>): List<Int> {
    return grades
        .filter { it >= 60 }
        .sorted()
        .take(3)
}

//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//
//Начальные значения: val list = listOf(
//    "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
//)
///Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy

fun transformToCatalog(strings: List<String>): Map<Char, List<String>> {
    return strings
        .map { it.lowercase() }
        .groupBy { it[0] }
}

//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//
//Начальные значения взять из предыдущей задачи.
//
//Цель: Перевести все слова в количество букв, подсчитать среднее значение.
// Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.

fun countAverageWordLength(strings: List<String>): String {
    val average = strings
        .map { it.length }
        .average()

    return "%.2f".format(average)
}

//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
//
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).

fun categorizeNumbers(numbers: List<Int>): Map<String, List<Int>> {
    return numbers
        .distinct()
        .sortedDescending()
        .groupBy { if (it % 2 == 0) "четные" else "нечетные" }
}

//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.
//
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его,
// либо null если значения не нашлось.

fun findFirstAge(ages: List<Int?>, age: Int): Int? {
    return ages.firstOrNull { it != null && it > age }
}
